konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/lis2hh12_reg.h
/**
  ******************************************************************************
  * @file    lis2hh12_reg.h
  * @author  Sensors Software Solution Team
  * @brief   This file contains all the functions prototypes for the
  *          lis2hh12_reg.c driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef LIS2HH12_REGS_H
#define LIS2HH12_REGS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <stddef.h>
#include <math.h>

/** @addtogroup LIS2HH12
  * @{
  *
  */

/** @defgroup  Endianness definitions
  * @{
  *
  */

#ifndef DRV_BYTE_ORDER
#ifndef __BYTE_ORDER__

#define DRV_LITTLE_ENDIAN 1234
#define DRV_BIG_ENDIAN    4321

/** if _BYTE_ORDER is not defined, choose the endianness of your architecture
  * by uncommenting the define which fits your platform endianness
  */
//#define DRV_BYTE_ORDER    DRV_BIG_ENDIAN
#define DRV_BYTE_ORDER    DRV_LITTLE_ENDIAN

#else /* defined __BYTE_ORDER__ */

#define DRV_LITTLE_ENDIAN  __ORDER_LITTLE_ENDIAN__
#define DRV_BIG_ENDIAN     __ORDER_BIG_ENDIAN__
#define DRV_BYTE_ORDER     __BYTE_ORDER__

#endif /* __BYTE_ORDER__*/
#endif /* DRV_BYTE_ORDER */

/**
  * @}
  *
  */

/** @defgroup STMicroelectronics sensors common types
  * @{
  *
  */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0       : 1;
  uint8_t bit1       : 1;
  uint8_t bit2       : 1;
  uint8_t bit3       : 1;
  uint8_t bit4       : 1;
  uint8_t bit5       : 1;
  uint8_t bit6       : 1;
  uint8_t bit7       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7       : 1;
  uint8_t bit6       : 1;
  uint8_t bit5       : 1;
  uint8_t bit4       : 1;
  uint8_t bit3       : 1;
  uint8_t bit2       : 1;
  uint8_t bit1       : 1;
  uint8_t bit0       : 1;
#endif /* DRV_BYTE_ORDER */
} bitwise_t;

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)

/** @addtogroup  Interfaces_Functions
  * @brief       This section provide a set of functions used to read and
  *              write a generic register of the device.
  *              MANDATORY: return 0 -> no Error.
  * @{
  *
  */

typedef int32_t (*stmdev_write_ptr)(void *, uint8_t, const uint8_t *, uint16_t);
typedef int32_t (*stmdev_read_ptr)(void *, uint8_t, uint8_t *, uint16_t);
typedef void (*stmdev_mdelay_ptr)(uint32_t millisec);

typedef struct
{
  /** Component mandatory fields **/
  stmdev_write_ptr  write_reg;
  stmdev_read_ptr   read_reg;
  /** Component optional fields **/
  stmdev_mdelay_ptr   mdelay;
  /** Customizable optional pointer **/
  void *handle;
} stmdev_ctx_t;

/**
  * @}
  *
  */

#endif /* MEMS_SHARED_TYPES */

#ifndef MEMS_UCF_SHARED_TYPES
#define MEMS_UCF_SHARED_TYPES

/** @defgroup    Generic address-data structure definition
  * @brief       This structure is useful to load a predefined configuration
  *              of a sensor.
  *              You can create a sensor configuration by your own or using
  *              Unico / Unicleo tools available on STMicroelectronics
  *              web site.
  *
  * @{
  *
  */

typedef struct
{
  uint8_t address;
  uint8_t data;
} ucf_line_t;

/**
  * @}
  *
  */

#endif /* MEMS_UCF_SHARED_TYPES */

/**
  * @}
  *
  */

/** @defgroup LIS2HH12_Infos
  * @{
  *
  */

/** I2C Device Address 8 bit format  if SA0=0 -> 0x3D if SA0=1 -> 0x3B **/
#define LIS2HH12_I2C_ADD_L                   0x3DU // For Read
#define LIS2HH12_I2C_ADD_L_W                 0x3CU // For Write
#define LIS2HH12_I2C_ADD_H                   0x3BU
/** Device Identification (Who am I) **/
#define LIS2HH12_ID                          0x41U

/**
  * @}
  *
  */

#define LIS2HH12_TEMP_L                      0x0BU
#define LIS2HH12_TEMP_H                      0x0CU
#define LIS2HH12_WHO_AM_I                    0x0FU
#define LIS2HH12_ACT_THS                     0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ths              : 7;
  uint8_t not_used_01      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01      : 1;
  uint8_t ths              : 7;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_act_ths_t;

#define LIS2HH12_ACT_DUR                     0x1FU
typedef struct
{
  uint8_t dur      : 8;
} lis2hh12_act_dur_t;

#define LIS2HH12_CTRL1                       0x20U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xen              : 1;
  uint8_t yen              : 1;
  uint8_t zen              : 1;
  uint8_t bdu              : 1;
  uint8_t odr              : 3;
  uint8_t hr               : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t hr               : 1;
  uint8_t odr              : 3;
  uint8_t bdu              : 1;
  uint8_t zen              : 1;
  uint8_t yen              : 1;
  uint8_t xen              : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ctrl1_t;

#define LIS2HH12_CTRL2                       0x21U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t hpis             : 2;
  uint8_t fds              : 1;
  uint8_t hpm              : 2;
  uint8_t dfc              : 2;
  uint8_t not_used_01      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01      : 1;
  uint8_t dfc              : 2;
  uint8_t hpm              : 2;
  uint8_t fds              : 1;
  uint8_t hpis             : 2;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ctrl2_t;

#define LIS2HH12_CTRL3                       0x22U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1_drdy        : 1;
  uint8_t int1_fth         : 1;
  uint8_t int1_ovr         : 1;
  uint8_t int1_ig1         : 1;
  uint8_t int1_ig2         : 1;
  uint8_t int1_inact       : 1;
  uint8_t stop_fth         : 1;
  uint8_t fifo_en          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_en          : 1;
  uint8_t stop_fth         : 1;
  uint8_t int1_inact       : 1;
  uint8_t int1_ig2         : 1;
  uint8_t int1_ig1         : 1;
  uint8_t int1_ovr         : 1;
  uint8_t int1_fth         : 1;
  uint8_t int1_drdy        : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ctrl3_t;

#define LIS2HH12_CTRL4                       0x23U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sim              : 1;
  uint8_t i2c_disable      : 1;
  uint8_t if_add_inc       : 1;
  uint8_t bw_scale_odr     : 1;
  uint8_t fs               : 2;
  uint8_t bw               : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bw               : 2;
  uint8_t fs               : 2;
  uint8_t bw_scale_odr     : 1;
  uint8_t if_add_inc       : 1;
  uint8_t i2c_disable      : 1;
  uint8_t sim              : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ctrl4_t;

#define LIS2HH12_CTRL5                       0x24U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pp_od            : 1;
  uint8_t h_lactive        : 1;
  uint8_t st               : 2;
  uint8_t dec              : 2;
  uint8_t soft_reset       : 1;
  uint8_t debug            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t debug            : 1;
  uint8_t soft_reset       : 1;
  uint8_t dec              : 2;
  uint8_t st               : 2;
  uint8_t h_lactive        : 1;
  uint8_t pp_od            : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ctrl5_t;

#define LIS2HH12_CTRL6                       0x25U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_drdy        : 1;
  uint8_t int2_fth         : 1;
  uint8_t int2_empty       : 1;
  uint8_t int2_ig1         : 1;
  uint8_t int2_ig2         : 1;
  uint8_t int2_boot        : 1;
  uint8_t not_used_01      : 1;
  uint8_t boot             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t boot             : 1;
  uint8_t not_used_01      : 1;
  uint8_t int2_boot        : 1;
  uint8_t int2_ig2         : 1;
  uint8_t int2_ig1         : 1;
  uint8_t int2_empty       : 1;
  uint8_t int2_fth         : 1;
  uint8_t int2_drdy        : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ctrl6_t;

