konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/lis2hh12_reg.h
#define LIS2HH12_CTRL7                       0x26U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t _4d_ig           : 2;
  uint8_t lir              : 2;
  uint8_t dcrm             : 2;
  uint8_t not_used_01      : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01      : 2;
  uint8_t dcrm             : 2;
  uint8_t lir              : 2;
  uint8_t _4d_ig           : 2;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ctrl7_t;

#define LIS2HH12_STATUS                      0x27U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xda              : 1;
  uint8_t yda              : 1;
  uint8_t zda              : 1;
  uint8_t zyxda            : 1;
  uint8_t _xor             : 1;
  uint8_t yor              : 1;
  uint8_t zor              : 1;
  uint8_t zyxor            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t zyxor            : 1;
  uint8_t zor              : 1;
  uint8_t yor              : 1;
  uint8_t _xor             : 1;
  uint8_t zyxda            : 1;
  uint8_t zda              : 1;
  uint8_t yda              : 1;
  uint8_t xda              : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_status_t;

#define LIS2HH12_OUT_X_L                     0x28U
#define LIS2HH12_OUT_X_H                     0x29U
#define LIS2HH12_OUT_Y_L                     0x2AU
#define LIS2HH12_OUT_Y_H                     0x2BU
#define LIS2HH12_OUT_Z_L                     0x2CU
#define LIS2HH12_OUT_Z_H                     0x2DU
#define LIS2HH12_FIFO_CTRL                   0x2EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fth              : 5;
  uint8_t fmode            : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fmode            : 3;
  uint8_t fth              : 5;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_fifo_ctrl_t;

#define LIS2HH12_FIFO_SRC                    0x2FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fss              : 5;
  uint8_t empty            : 1;
  uint8_t ovr              : 1;
  uint8_t fth              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fth              : 1;
  uint8_t ovr              : 1;
  uint8_t empty            : 1;
  uint8_t fss              : 5;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_fifo_src_t;

#define LIS2HH12_IG_CFG1                     0x30U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlie             : 1;
  uint8_t xhie             : 1;
  uint8_t ylie             : 1;
  uint8_t yhie             : 1;
  uint8_t zlie             : 1;
  uint8_t zhie             : 1;
  uint8_t _6d              : 1;
  uint8_t aoi              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t aoi              : 1;
  uint8_t _6d              : 1;
  uint8_t zhie             : 1;
  uint8_t zlie             : 1;
  uint8_t yhie             : 1;
  uint8_t ylie             : 1;
  uint8_t xhie             : 1;
  uint8_t xlie             : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ig_cfg1_t;

#define LIS2HH12_IG_SRC1                     0x31U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl               : 1;
  uint8_t xh               : 1;
  uint8_t yl               : 1;
  uint8_t yh               : 1;
  uint8_t zl               : 1;
  uint8_t zh               : 1;
  uint8_t ia               : 1;
  uint8_t not_used_01      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01      : 1;
  uint8_t ia               : 1;
  uint8_t zh               : 1;
  uint8_t zl               : 1;
  uint8_t yh               : 1;
  uint8_t yl               : 1;
  uint8_t xh               : 1;
  uint8_t xl               : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ig_src1_t;

#define LIS2HH12_IG_THS_X1                   0x32U
#define LIS2HH12_IG_THS_Y1                   0x33U
#define LIS2HH12_IG_THS_Z1                   0x34U
#define LIS2HH12_IG_DUR1                     0x35U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dur1             : 7;
  uint8_t wait1            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wait1            : 1;
  uint8_t dur1             : 7;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ig_dur1_t;

#define LIS2HH12_IG_CFG2                     0x36U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlie             : 1;
  uint8_t xhie             : 1;
  uint8_t ylie             : 1;
  uint8_t yhie             : 1;
  uint8_t zlie             : 1;
  uint8_t zhie             : 1;
  uint8_t _6d              : 1;
  uint8_t aoi              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t aoi              : 1;
  uint8_t _6d              : 1;
  uint8_t zhie             : 1;
  uint8_t zlie             : 1;
  uint8_t yhie             : 1;
  uint8_t ylie             : 1;
  uint8_t xhie             : 1;
  uint8_t xlie             : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ig_cfg2_t;

#define LIS2HH12_IG_SRC2                     0x37U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl               : 1;
  uint8_t xh               : 1;
  uint8_t yl               : 1;
  uint8_t yh               : 1;
  uint8_t zl               : 1;
  uint8_t zh               : 1;
  uint8_t ia               : 1;
  uint8_t not_used_01      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01      : 1;
  uint8_t ia               : 1;
  uint8_t zh               : 1;
  uint8_t zl               : 1;
  uint8_t yh               : 1;
  uint8_t yl               : 1;
  uint8_t xh               : 1;
  uint8_t xl               : 1;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ig_src2_t;

#define LIS2HH12_IG_THS2                     0x38U
#define LIS2HH12_IG_DUR2                     0x39U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dur2             : 7;
  uint8_t wait2            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wait2            : 1;
  uint8_t dur2             : 7;
#endif /* DRV_BYTE_ORDER */
} lis2hh12_ig_dur2_t;

#define LIS2HH12_XL_REFERENCE                0x3AU
#define LIS2HH12_XH_REFERENCE                0x3BU
#define LIS2HH12_YL_REFERENCE                0x3CU
#define LIS2HH12_YH_REFERENCE                0x3DU
#define LIS2HH12_ZL_REFERENCE                0x3EU
#define LIS2HH12_ZH_REFERENCE                0x3FU

/**
  * @defgroup LIS2HH12_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  lis2hh12_act_ths_t       act_ths;
  lis2hh12_act_dur_t       act_dur;
  lis2hh12_ctrl1_t         ctrl1;
  lis2hh12_ctrl2_t         ctrl2;
  lis2hh12_ctrl3_t         ctrl3;
  lis2hh12_ctrl4_t         ctrl4;
  lis2hh12_ctrl5_t         ctrl5;
  lis2hh12_ctrl6_t         ctrl6;
  lis2hh12_ctrl7_t         ctrl7;
  lis2hh12_status_t        status;
  lis2hh12_fifo_ctrl_t     fifo_ctrl;
  lis2hh12_fifo_src_t      fifo_src;
  lis2hh12_ig_cfg1_t       ig_cfg1;
  lis2hh12_ig_src1_t       ig_src1;
  lis2hh12_ig_dur1_t       ig_dur1;
  lis2hh12_ig_cfg2_t       ig_cfg2;
  lis2hh12_ig_src2_t       ig_src2;
  lis2hh12_ig_dur2_t       ig_dur2;
  bitwise_t                bitwise;
  uint8_t                  byte;
} lis2hh12_reg_t;

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

