konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/lis2hh12_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t lis2hh12_read_reg(stmdev_ctx_t *ctx, uint8_t reg,
                          uint8_t *data,
                          uint16_t len);
int32_t lis2hh12_write_reg(stmdev_ctx_t *ctx, uint8_t reg,
                           uint8_t *data,
                           uint16_t len);

float_t lis2hh12_from_fs2g_to_mg(int16_t lsb);
float_t lis2hh12_from_fs4g_to_mg(int16_t lsb);
float_t lis2hh12_from_fs8g_to_mg(int16_t lsb);

float_t lis2hh12_from_lsb_to_celsius(int16_t lsb);

typedef struct
{
  uint8_t xen              : 1;
  uint8_t yen              : 1;
  uint8_t zen              : 1;
} lis2hh12_xl_axis_t;
int32_t lis2hh12_xl_axis_set(stmdev_ctx_t *ctx,
                             lis2hh12_xl_axis_t val);
int32_t lis2hh12_xl_axis_get(stmdev_ctx_t *ctx,
                             lis2hh12_xl_axis_t *val);

int32_t lis2hh12_block_data_update_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lis2hh12_block_data_update_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  LIS2HH12_XL_ODR_OFF      = 0x00,
  LIS2HH12_XL_ODR_10Hz     = 0x01,
  LIS2HH12_XL_ODR_50Hz     = 0x02,
  LIS2HH12_XL_ODR_100Hz    = 0x03,
  LIS2HH12_XL_ODR_200Hz    = 0x04,
  LIS2HH12_XL_ODR_400Hz    = 0x05,
  LIS2HH12_XL_ODR_800Hz    = 0x06,
} lis2hh12_xl_data_rate_t;
int32_t lis2hh12_xl_data_rate_set(stmdev_ctx_t *ctx,
                                  lis2hh12_xl_data_rate_t val);
int32_t lis2hh12_xl_data_rate_get(stmdev_ctx_t *ctx,
                                  lis2hh12_xl_data_rate_t *val);

typedef enum
{
  LIS2HH12_2g              = 0x00,
  LIS2HH12_16g             = 0x01,
  LIS2HH12_4g              = 0x02,
  LIS2HH12_8g              = 0x03,
} lis2hh12_xl_fs_t;
int32_t lis2hh12_xl_full_scale_set(stmdev_ctx_t *ctx,
                                   lis2hh12_xl_fs_t val);
int32_t lis2hh12_xl_full_scale_get(stmdev_ctx_t *ctx,
                                   lis2hh12_xl_fs_t *val);

typedef enum
{
  LIS2HH12_NO_DECIMATION   = 0x00,
  LIS2HH12_EVERY_2_SAMPLES = 0x01,
  LIS2HH12_EVERY_4_SAMPLES = 0x02,
  LIS2HH12_EVERY_8_SAMPLES = 0x03,
} lis2hh12_dec_t;
int32_t lis2hh12_xl_decimation_set(stmdev_ctx_t *ctx,
                                   lis2hh12_dec_t val);
int32_t lis2hh12_xl_decimation_get(stmdev_ctx_t *ctx,
                                   lis2hh12_dec_t *val);

int32_t lis2hh12_xl_flag_data_ready_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lis2hh12_temperature_raw_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t lis2hh12_acceleration_raw_get(stmdev_ctx_t *ctx,
                                      int16_t *val);

int32_t lis2hh12_dev_id_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lis2hh12_dev_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2hh12_dev_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2hh12_dev_boot_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2hh12_dev_boot_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t xda              : 1;
  uint8_t yda              : 1;
  uint8_t zda              : 1;
  uint8_t zyxda            : 1;
  uint8_t _xor             : 1;
  uint8_t yor              : 1;
  uint8_t zor              : 1;
  uint8_t zyxor            : 1;
} lis2hh12_status_reg_t;
int32_t lis2hh12_dev_status_get(stmdev_ctx_t *ctx,
                                lis2hh12_status_reg_t *val);

typedef enum
{
  LIS2HH12_HP_DISABLE      = 0x00,
  LIS2HH12_HP_ON_INT_GEN_1 = 0x02,
  LIS2HH12_HP_ON_INT_GEN_2 = 0x01,
  LIS2HH12_HP_ON_BOTH_GEN  = 0x03,
} lis2hh12_xl_hp_path_t;
int32_t lis2hh12_xl_filter_int_path_set(stmdev_ctx_t *ctx,
                                        lis2hh12_xl_hp_path_t val);
int32_t lis2hh12_xl_filter_int_path_get(stmdev_ctx_t *ctx,
                                        lis2hh12_xl_hp_path_t *val);

typedef enum
{
  LIS2HH12_BYPASSED        = 0x00,
  LIS2HH12_FILT_HP         = 0x02,
  LIS2HH12_FILT_LP         = 0x01,
} lis2hh12_xl_out_path_t;
int32_t lis2hh12_xl_filter_out_path_set(stmdev_ctx_t *ctx,
                                        lis2hh12_xl_out_path_t val);
int32_t lis2hh12_xl_filter_out_path_get(stmdev_ctx_t *ctx,
                                        lis2hh12_xl_out_path_t *val);

typedef enum
{
  LIS2HH12_HP_ODR_DIV_50          = 0x00,
  LIS2HH12_HP_ODR_DIV_100         = 0x10,
  LIS2HH12_HP_ODR_DIV_9           = 0x20,
  LIS2HH12_HP_ODR_DIV_400         = 0x30,
  LIS2HH12_HP_ODR_DIV_50_REF_MD   = 0x01,
  LIS2HH12_HP_ODR_DIV_100_REF_MD  = 0x11,
  LIS2HH12_HP_ODR_DIV_9_REF_MD    = 0x21,
  LIS2HH12_HP_ODR_DIV_400_REF_MD  = 0x31,
} lis2hh12_xl_hp_bw_t;
int32_t lis2hh12_xl_filter_hp_bandwidth_set(stmdev_ctx_t *ctx,
                                            lis2hh12_xl_hp_bw_t val);
int32_t lis2hh12_xl_filter_hp_bandwidth_get(stmdev_ctx_t *ctx,
                                            lis2hh12_xl_hp_bw_t *val);

typedef enum
{
  LIS2HH12_LP_ODR_DIV_50   = 0,
  LIS2HH12_LP_ODR_DIV_100  = 1,
  LIS2HH12_LP_ODR_DIV_9    = 2,
  LIS2HH12_LP_ODR_DIV_400  = 3,
} lis2hh12_xl_lp_bw_t;
int32_t lis2hh12_xl_filter_low_bandwidth_set(stmdev_ctx_t *ctx,
                                             lis2hh12_xl_lp_bw_t val);
int32_t lis2hh12_xl_filter_low_bandwidth_get(stmdev_ctx_t *ctx,
                                             lis2hh12_xl_lp_bw_t *val);

typedef enum
{
  LIS2HH12_AUTO      = 0x00,
  LIS2HH12_408Hz     = 0x10,
  LIS2HH12_211Hz     = 0x11,
  LIS2HH12_105Hz     = 0x12,
  LIS2HH12_50Hz      = 0x13,
} lis2hh12_xl_filt_aa_bw_t;
int32_t lis2hh12_xl_filter_aalias_bandwidth_set(stmdev_ctx_t *ctx,
                                                lis2hh12_xl_filt_aa_bw_t val);
int32_t lis2hh12_xl_filter_aalias_bandwidth_get(stmdev_ctx_t *ctx,
                                                lis2hh12_xl_filt_aa_bw_t *val);

int32_t lis2hh12_xl_filter_reference_set(stmdev_ctx_t *ctx,
                                         int16_t *val);
int32_t lis2hh12_xl_filter_reference_get(stmdev_ctx_t *ctx,
                                         int16_t *val);

