konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/lis2hh12_reg.h
typedef enum
{
  LIS2HH12_SPI_4_WIRE = 0x00,
  LIS2HH12_SPI_3_WIRE = 0x01,
} lis2hh12_sim_t;
int32_t lis2hh12_spi_mode_set(stmdev_ctx_t *ctx, lis2hh12_sim_t val);
int32_t lis2hh12_spi_mode_get(stmdev_ctx_t *ctx, lis2hh12_sim_t *val);

typedef enum
{
  LIS2HH12_I2C_ENABLE  = 0x00,
  LIS2HH12_I2C_DISABLE = 0x01,
} lis2hh12_i2c_dis_t;
int32_t lis2hh12_i2c_interface_set(stmdev_ctx_t *ctx,
                                   lis2hh12_i2c_dis_t val);
int32_t lis2hh12_i2c_interface_get(stmdev_ctx_t *ctx,
                                   lis2hh12_i2c_dis_t *val);

typedef enum
{
  LIS2HH12_DISABLE = 0x00,
  LIS2HH12_ENABLE  = 0x01,
} lis2hh12_auto_inc_t;
int32_t lis2hh12_auto_increment_set(stmdev_ctx_t *ctx,
                                    lis2hh12_auto_inc_t val);
int32_t lis2hh12_auto_increment_get(stmdev_ctx_t *ctx,
                                    lis2hh12_auto_inc_t *val);

typedef struct
{
  uint8_t int1_drdy            : 1;
  uint8_t int1_fth             : 1;
  uint8_t int1_ovr             : 1;
  uint8_t int1_ig1             : 1;
  uint8_t int1_ig2             : 1;
  uint8_t int1_inact           : 1;
} lis2hh12_pin_int1_route_t;
int32_t lis2hh12_pin_int1_route_set(stmdev_ctx_t *ctx,
                                    lis2hh12_pin_int1_route_t val);
int32_t lis2hh12_pin_int1_route_get(stmdev_ctx_t *ctx,
                                    lis2hh12_pin_int1_route_t *val);

typedef enum
{
  LIS2HH12_PUSH_PULL       = 0x00,
  LIS2HH12_OPEN_DRAIN      = 0x01,
} lis2hh12_pp_od_t;
int32_t lis2hh12_pin_mode_set(stmdev_ctx_t *ctx,
                              lis2hh12_pp_od_t val);
int32_t lis2hh12_pin_mode_get(stmdev_ctx_t *ctx,
                              lis2hh12_pp_od_t *val);

typedef enum
{
  LIS2HH12_ACTIVE_HIGH     = 0x00,
  LIS2HH12_ACTIVE_LOW      = 0x01,
} lis2hh12_pin_pol_t;
int32_t lis2hh12_pin_polarity_set(stmdev_ctx_t *ctx,
                                  lis2hh12_pin_pol_t val);
int32_t lis2hh12_pin_polarity_get(stmdev_ctx_t *ctx,
                                  lis2hh12_pin_pol_t *val);

typedef struct
{
  uint8_t int2_drdy            : 1;
  uint8_t int2_fth             : 1;
  uint8_t int2_empty           : 1;
  uint8_t int2_ig1             : 1;
  uint8_t int2_ig2             : 1;
  uint8_t int2_boot            : 1;
} lis2hh12_pin_int2_route_t;
int32_t lis2hh12_pin_int2_route_set(stmdev_ctx_t *ctx,
                                    lis2hh12_pin_int2_route_t val);
int32_t lis2hh12_pin_int2_route_get(stmdev_ctx_t *ctx,
                                    lis2hh12_pin_int2_route_t *val);

typedef enum
{
  LIS2HH12_INT_PULSED      = 0x00,
  LIS2HH12_INT_LATCHED     = 0x01,
} lis2hh12_lir_t;
int32_t lis2hh12_pin_notification_set(stmdev_ctx_t *ctx,
                                      lis2hh12_lir_t val);
int32_t lis2hh12_pin_notification_get(stmdev_ctx_t *ctx,
                                      lis2hh12_lir_t *val);
typedef enum
{
  LIS2HH12_IG1_OR_IG2_OR   = 0x00,
  LIS2HH12_IG1_AND_IG2_OR  = 0x01,
  LIS2HH12_IG1_OR_IG2_AND  = 0x10,
  LIS2HH12_IG1_AND_IG2_AND = 0x11,
} lis2hh12_pin_logic_t;
int32_t lis2hh12_pin_logic_set(stmdev_ctx_t *ctx,
                               lis2hh12_pin_logic_t val);
int32_t lis2hh12_pin_logic_get(stmdev_ctx_t *ctx,
                               lis2hh12_pin_logic_t *val);

typedef enum
{
  LIS2HH12_RESET_MODE      = 0x00,
  LIS2HH12_DECREMENT_MODE  = 0x01,
} lis2hh12_dcrm_t;
int32_t lis2hh12_xl_trshld_mode_set(stmdev_ctx_t *ctx,
                                    lis2hh12_dcrm_t val);
int32_t lis2hh12_xl_trshld_mode_get(stmdev_ctx_t *ctx,
                                    lis2hh12_dcrm_t *val);

typedef struct
{
  uint16_t ig1_xlie             : 1;
  uint16_t ig1_xhie             : 1;
  uint16_t ig1_ylie             : 1;
  uint16_t ig1_yhie             : 1;
  uint16_t ig1_zlie             : 1;
  uint16_t ig1_zhie             : 1;
  uint16_t ig2_xlie             : 1;
  uint16_t ig2_xhie             : 1;
  uint16_t ig2_ylie             : 1;
  uint16_t ig2_yhie             : 1;
  uint16_t ig2_zlie             : 1;
  uint16_t ig2_zhie             : 1;
} lis2hh12_xl_trshld_en_t;
int32_t lis2hh12_xl_trshld_axis_set(stmdev_ctx_t *ctx,
                                    lis2hh12_xl_trshld_en_t val);
int32_t lis2hh12_xl_trshld_axis_get(stmdev_ctx_t *ctx,
                                    lis2hh12_xl_trshld_en_t *val);

typedef struct
{
  uint16_t ig1_xl             : 1;
  uint16_t ig1_xh             : 1;
  uint16_t ig1_yl             : 1;
  uint16_t ig1_yh             : 1;
  uint16_t ig1_zl             : 1;
  uint16_t ig1_zh             : 1;
  uint16_t ig1_ia             : 1;
  uint16_t ig2_xl             : 1;
  uint16_t ig2_xh             : 1;
  uint16_t ig2_yl             : 1;
  uint16_t ig2_yh             : 1;
  uint16_t ig2_zl             : 1;
  uint16_t ig2_zh             : 1;
  uint16_t ig2_ia             : 1;
} lis2hh12_xl_trshld_src_t;
int32_t lis2hh12_xl_trshld_src_get(stmdev_ctx_t *ctx,
                                   lis2hh12_xl_trshld_src_t *val);

int32_t lis2hh12_xl_trshld_set(stmdev_ctx_t *ctx, uint8_t ig1_x,
                               uint8_t ig1_y, uint8_t ig1_z,
                               uint8_t ig2_xyz);
int32_t lis2hh12_xl_trshld_get(stmdev_ctx_t *ctx, uint8_t *ig1_x,
                               uint8_t *ig1_y, uint8_t *ig1_z,
                               uint8_t *ig2_xyz);

int32_t lis2hh12_xl_trshld_min_sample_set(stmdev_ctx_t *ctx,
                                          uint8_t ig1_sam, uint8_t ig2_sam);
int32_t lis2hh12_xl_trshld_min_sample_get(stmdev_ctx_t *ctx,
                                          uint8_t *ig1_sam, uint8_t *ig2_sam);

int32_t lis2hh12_act_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2hh12_act_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2hh12_act_duration_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2hh12_act_duration_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS2HH12_6D_4D_DISABLE       = 0x00,
  LIS2HH12_ENABLE_ON_IG1_6D    = 0x01,
  LIS2HH12_ENABLE_ON_IG2_6D    = 0x02,
  LIS2HH12_ENABLE_ON_IG1_4D    = 0x11,
  LIS2HH12_ENABLE_ON_IG2_4D    = 0x12,
} lis2hh12_6d_mode_t;
