konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/lis2hh12_reg.h
int32_t lis2hh12_6d_mode_set(stmdev_ctx_t *ctx,
                             lis2hh12_6d_mode_t val);
int32_t lis2hh12_6d_mode_get(stmdev_ctx_t *ctx,
                             lis2hh12_6d_mode_t *val);

int32_t lis2hh12_fifo_watermark_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2hh12_fifo_watermark_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS2HH12_FIFO_OFF               = 0x00,
  LIS2HH12_BYPASS_MODE            = 0x10,
  LIS2HH12_FIFO_MODE              = 0x11,
  LIS2HH12_STREAM_MODE            = 0x12,
  LIS2HH12_STREAM_TO_FIFO_MODE   = 0x13,
  LIS2HH12_BYPASS_TO_STREAM_MODE = 0x14,
  LIS2HH12_BYPASS_TO_FIFO_MODE   = 0x17,
} lis2hh12_fifo_md_t;
int32_t lis2hh12_fifo_mode_set(stmdev_ctx_t *ctx,
                               lis2hh12_fifo_md_t val);
int32_t lis2hh12_fifo_mode_get(stmdev_ctx_t *ctx,
                               lis2hh12_fifo_md_t *val);

typedef struct
{
  uint8_t fss             : 5;
  uint8_t empty           : 1;
  uint8_t ovr             : 1;
  uint8_t fth             : 1;
} lis2hh12_fifo_stat_t;
int32_t lis2hh12_fifo_status_get(stmdev_ctx_t *ctx,
                                 lis2hh12_fifo_stat_t *val);

typedef enum
{
  LIS2HH12_ST_DISABLE    = 0x00,
  LIS2HH12_ST_POSITIVE   = 0x01,
  LIS2HH12_ST_NEGATIVE   = 0x02,
} lis2hh12_xl_st_t;
int32_t lis2hh12_xl_self_test_set(stmdev_ctx_t *ctx,
                                  lis2hh12_xl_st_t val);
int32_t lis2hh12_xl_self_test_get(stmdev_ctx_t *ctx,
                                  lis2hh12_xl_st_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LIS2HH12_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
